conjugateHeat/k0.03RadNoB/0/bottomAir/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/bottomAir";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 1 0 0 0 ];

internalField   uniform 1200;

boundaryField
{
    bottomAir_bottom
    {
        type            symmetryPlane;
        value           uniform 0;
    }
    leftLet
    {
        type            fixedValue;
        value           uniform 1200;
    }
    rightLet
    {
        type            zeroGradient;
        value           uniform 0;
    }
    frontAndBack
    {
        type            empty;
    }
    bottomAir_to_wall
    {
        type            compressible::turbulentTemperatureCoupledBaffleMixed;
        value           uniform 300;
        Tnbr            T;
        kappa           fluidThermo;
        kappaName       none;
    }
}


// ************************************************************************* //
